/*
 * To change this license header, choose License Headers in Project Properties.
 * To change this template file, choose Tools | Templates
 * and open the template in the editor.
 */
package com.mycompany.netreali;

import java.util.HashMap;
import java.util.HashSet;
import java.util.Map;
import java.util.Set;

/**
 *
 * @author oshrat
 */
public class BagOfWordsSimilarity {

    public static double consineTextSimilarity(String[] left, String[] right) {
        Map<String, Integer> leftWordCountMap = new HashMap<String, Integer>();
        Map<String, Integer> rightWordCountMap = new HashMap<String, Integer>();
        Set<String> uniqueSet = new HashSet<String>();
        Integer temp = null;
        for (String leftWord : left) {
            temp = leftWordCountMap.get(leftWord);
            if (temp == null) {
                leftWordCountMap.put(leftWord, 1);
                uniqueSet.add(leftWord);
            } else {
                leftWordCountMap.put(leftWord, temp + 1);
            }
        }
        for (String rightWord : right) {
            temp = rightWordCountMap.get(rightWord);
            if (temp == null) {
                rightWordCountMap.put(rightWord, 1);
                uniqueSet.add(rightWord);
            } else {
                rightWordCountMap.put(rightWord, temp + 1);
            }
        }
        int[] leftVector = new int[uniqueSet.size()];
        int[] rightVector = new int[uniqueSet.size()];
        int index = 0;
        Integer tempCount = 0;
        for (String uniqueWord : uniqueSet) {
            tempCount = leftWordCountMap.get(uniqueWord);
            leftVector[index] = tempCount == null ? 0 : tempCount;
            tempCount = rightWordCountMap.get(uniqueWord);
            rightVector[index] = tempCount == null ? 0 : tempCount;
            index++;
        }            
        
        return consineVectorSimilarity(leftVector, rightVector);
    }

    /**
     * The resulting similarity ranges from −1 meaning exactly opposite, to 1
     * meaning exactly the same, with 0 usually indicating independence, and
     * in-between values indicating intermediate similarity or dissimilarity.
     *
     * For text matching, the attribute vectors A and B are usually the term
     * frequency vectors of the documents. The cosine similarity can be seen as
     * a method of normalizing document length during comparison.
     *
     * In the case of information retrieval, the cosine similarity of two
     * documents will range from 0 to 1, since the term frequencies (tf-idf
     * weights) cannot be negative. The angle between two term frequency vectors
     * cannot be greater than 90°.
     *
     * @param leftVector
     * @param rightVector
     * @return
     */
    private static double consineVectorSimilarity(int[] leftVector,
            int[] rightVector) {
        if (leftVector.length != rightVector.length) {
            return 1;
        }
        double dotProduct = 0;
        double leftNorm = 0;
        double rightNorm = 0;
        for (int i = 0; i < leftVector.length; i++) {
            dotProduct += leftVector[i] * rightVector[i];
            leftNorm += leftVector[i] * leftVector[i];
            rightNorm += rightVector[i] * rightVector[i];
        }

        double result = dotProduct
                / (Math.sqrt(leftNorm) * Math.sqrt(rightNorm));
        return result;
    }

    public static void main(String[] args) {
        // String left[] = {"Julie", "loves", "me", "more", "than", "Linda", "loves", "me"};
        // String right[] = {"Jane", "likes", "me", "more", "than", "Julie", "loves", "me"};
        
        String title = "פצמ\"רים נורו לעבר כוח צה\"ל שעבד על גבול רצועת עזה";
        String body = "תקרית חמורה בדרום: הפלסטינים ירו היום (חמישי) פצצות מרגמה לעבר כוח צה\"ל שביצע עבודות הנדסיות על גבול הרצועה. לא היו נפגעים. צה\"ל השיב אש לעבר עמדות של ארגון חמאס. בעקבות הירי הופסקה תנועת הרכבות בין אשקלון לשדרות. הרכבות מדרום יגיעו עד נתיבות ואילו הרכבות מצפון ייעצרו באשדוד. אוטובוסים יפעלו מתי התחנות לרווחת הנוסעים. מוקדם יותר נשמעה באזור עוטף עזה אזעקת צבע אדום, אבל היא הוגדרה כהתרעת שווא. דובר צה\"ל מסר כי \"לפני זמן קצר תקף צה\"ל באמצעות ירי טנקים וכלי טיס של חיל האוויר ארבע מטרות טרור ברצועת עזה. התקיפה בוצעה בתגובה לירי תלול המסלול שבוצע לעבר מוצב צבאי בצפון רצועת עזה. צה\"ל רואה בארגון הטרור חמאס האחראי למתרחש ברצועת עזה\". כזכור, לפני כחודשיים פוצץ צה\"ל מנהרה של ארגון הג'יהאד האסלאמי שחדרה לתוך שטח ישראל. בתקרית נהרגו 12 אנשי הארגון, כשגופות של חמישה מהם נמצאות בידי ישראל. לאחר התקרית איים הג'יהאד האסלאמי לנקום בישראל, ובעקבות זאת נפרסו ברחבי הארץ סוללות כיפת ברזל. לפני כשבועיים הורה צה\"ל לסגור אתרי מטיילים בסמוך לרצועת עזה בעקבות חשש מפיגועי צלפים וירי נ\"ט של ארגון הטרור הסוני. בשבוע שעבר פורסם כי הוגש כתב אישום נגד פעיל חמאס שחצה את הגבול מעזה לישראל. איש, אחמד עביד, בן 23 משכונת סג'עייה, שבעזה, התגייס לארגון הטרור ב-2013. במסגרת פעילותו בחמאס עבר הכשרה צבאית ונטל חלק באימונים צבאיים בתחומי הנ\"ט, ההנדסה והצליפה. עוד עלה כי לקח חלק בחפירת מנהרות בגזרת מגוריו וכן שימש כפעיל כוח הריסון (אבטחת הגבולות) מטעם חמאס. משב\"כ והמשטרה נמסר כי בחקירתו של עביד התקבל מידע רב אודות פעילות מערך המנהרות של חמאס ברצועת עזה - הן מנהרות המיועדות לפעילות התקפית נגד ישראל, והן מנהרות המיועדות ללחימה מול כוחות צה\"ל בתוך שטח הרצועה. חקירתו של עביד חשפה פעם נוספת את פעילות הטרור של חמאס בתחום המנהרות לקידום פעילות טרור כנגד מדינת ישראל. ב-23 באוקטובר הוגש לבית המשפט המחוזי בבאר שבע כתב אישום חמור המייחס לעביד עבירות ביטחון חמורות. יום קודם לכן פורסם כי רשות המעברים במשרד הביטחון סיכלה הברחה של כמה טונות חומר נפץ שהיו בדרכן לגורמי הטרור בעזה. לאחרונה, בשלב ההרצה של המעבדה, הגיעה למעבר כרם שלום משאית, שהובילה מטען של שמנים לרכב, שעוררה את חשד הבודקים הביטחוניים. דגימות מהשמנים הועברו לבדיקת המעבדה, אשר זיהתה שלא מדובר בשמן מנוע תמים, אלא בחומר מסוכן, המיועד לייצור חומרי נפץ בכמות גדולה מאוד.";        
        String bodyTrans1 = TxtTranslator.translate(body);        
        String[] bodyArr1 = bodyTrans1.split(" ");
        for (int i = 0; i < bodyArr1.length; i++) {
            bodyArr1[i] = bodyArr1[i]
                    .toLowerCase()
                    .replace(",", "")
                    .replace(".", "")
                    .replace("\'", "")
                    .replace("\"", "")
                    .trim();
        }
        
        String title2 = " פצמ\"רים נורו לעבר מוצב של צה\"ל בעוטף עזה, צה\"ל השיב באש לעמדות חמאס - חדשות";
        String body2 = "התחממות בגזרת עוטף עזה. מטח חריג במיוחד של פצצות מרגמה נורה בצהריים (יום ה') לעבר מוצב של צה\"ל בצפון הרצועה, באזור קיבוץ ארז. לא היו נפגעים. בתגובה תקפו מטוסי חיל האוויר וטנקים ארבע עמדות השייכות לזרועות הצבאיות של חמאס והג'יהאד האיסלאמי. בסך הכול נורו כ-10 פצמ\"רים שנפלו בשטח פתוח, סמוך למוצב. לפי הערכה של גורמים בצה\"ל, הירי כוון לעבר עבודות הנדסיות שבוצעו סמוך לגדר המערכת. גבול הרצועה, בצהריים(צילום: רועי עידן) (צילום: רועי עידן) האזור שבו נפלו הפצמ\"רים מדובר צה\"ל נמסר: \"לפני זמן קצר תקף צה\"ל באמצעות ירי טנקים וכלי טיס של חיל האוויר ארבע מטרות טרור ברצועת עזה. התקיפה בוצעה בתגובה לירי תלול המסלול שבוצע לעבר מוצב צבאי בצפון רצועת עזה. צה\"ל רואה בארגון הטרור חמאס האחראי למתרחש ברצועת עזה\". במקביל, ועל פי הנחיית גורמי ביטחון, הופסקה תנועת הרכבות בין אשקלון לשדרות לכשעה וחצי. כמו כן, חקלאים הונחו להתפנות מהשדות באזור העוטף והעבודות על המכשול נגד המנהרות שנבנה בעוטף הופסקו. בנוסף, בבית הספר היסודי \"חופים\" בקיבוץ יד מרדכי עוכבה יציאת התלמידים לבתיהם. זמן קצר קודם לכן נשמעה אזעקת צבע אדום במועצה האזורית שער הנגב. הערכת מצב של מח\"ט צפונית ומפקד מרחב לכיש של המשטרה סמוך למוצב(צילום: מתן צורי) X עומס בתחנת האוטובוס סמוך לרכבת בשדרות (צילום: בראל אפרים) סגור שליחה לחבר כתובת דוא''ל של החבר שמך כתובת הדוא''ל שלך נושא הקלידו את הקוד המוצג תמונה חדשה הסרטון נשלח לחברך סגור הטמעת הסרטון באתר שלך קוד להטמעה: ליד מקום מוגן בעוטף עזה(צילום: בראל אפרים) אמנון זרקא, המתגורר באזור התקרית, סיפר במשדר המיוחד של אולפן ynet: \"הייתי באתר הנטיעות של האבוקדו שלנו. את הצבע אדום שמעתי מרחוק, אבל לפני זה שמעתי נפילה ראשונה, נפילה שנייה ואחרי זה מטח של נפילות. אני חושב שלפחות עשר. זה היה מטח, היה ירי אחד לכינון, השני אולי גם, ואחרי זה מטח\". אחד החקלאים שהיה באזור סיפר ל-ynet: \"היינו חמישה עובדים במטע סמוך לגבול. פתאום החלה שורה של פיצוצים, אחד אחרי השני. נשכבנו על האדמה והנחנו ידיים על הראש. חשבנו שיורים עלינו. הפיצוצים נמשכו בערך 5 דקות ואיך שהם הסתיימו נכנסנו לכלים ועזבו את המקום במהירות. זו הייתה חוויה מטלטלת\". פרשננו לענייני צבא וביטחון רון בן ישי מעריך שהאחראי לירי הוא הג'יהאד האיסלאמי, ושלא יהיה לכך המשך בקרוב. לדבריו, הארגון ספג לחצים מאנשיו בשטח שרצו נקמה על אובדן המנהרה לפני כמה שבועות ועל ההרוגים שנספו בה. מצד שני חמאס ומצרים לחצו על הארגון להתאפק. גם האוכלוסייה ברצועה מתנגדת כעת לספוג עוד מצוקה שיביא סבב לחימה נוסף. הוא הוסיף כי נראה שהארגון התכוון שלא לפגוע בחיילי צה\"ל. גם צה\"ל לא גרם לאבדות בצד השני, מפני ששני הצדדים אינם רוצים בהסלמה.התגובה כוונה גם לעבר עמדות של חמאס מכיוון שהם הריבון בשטח והם אלו שאחראים לכל מה שיוצא מהרצועה, בין אם רצו בכך ובין אם לא. לאורך השבועות האחרונים, מאז השמיד צה\"ל מנהרת טרור של הג'יהאד האיסלאמי, הורגשה מתיחות בגבול הדרום מחשש לירי תגובה של הארגונים בעזה, וסוללות \"כיפת ברזל\" נפרסו גם באזור המרכז. בכמה מקרים הופעלו אזעקות צבע אדום באזורים שונים בעוטף עזה, אולם הן התבררו כהתרעות שווא. מצאתם טעות בכתבה? כתבו לנו";
        String bodyTrans2 = TxtTranslator.translate(body2);
        String[] bodyArr2 = bodyTrans2.split(" ");
        for (int i = 0; i < bodyArr2.length; i++) {
            bodyArr2[i] = bodyArr2[i]
                    .toLowerCase()
                    .replace(",", "")
                    .replace(".", "")
                    .replace("\'", "")
                    .replace("\"", "")
                    .trim();
        }
        
        String body3 = "כוחות הביטחון הרסו הבוקר (רביעי) נגרייה בלתי חוקית ביישוב נתיב האבות שבאזור יהודה ושומרון (איו\"ש), זאת בהתאם להוראת הממשלה, ולאחר שעשרות מפגינים צעירים התבצרו בה, כאשר בנוסף מאות אחרים מחו מחוץ למבנה. מדובר צה\"ל נמסר הבוקר כי \"בהתאם להנחיית הדרג המדיני החלו כוחות הביטחון בהריסת המבנה הבלתי חוקי בנתיב האבות. בפעילות משתתפים כוחות הביטחון במספר מעגלי אחריות ופועלים לפינוי המבנה תוך שמירה על הביטחון החוק והסדר\". לתושבים הרבים שהגיעו למקום, על מנת למנוע את הריסת המבנה, נמסר ברמקולים \"לא להרים יד על שוטרים או חיילים\", זאת לאחר שעשרות חדרו מוקדם יותר למבנה, כדי למנוע מכוחות מג\"ב, שהגיעו למקום, להרוס את המבנה. מדובר בנגרייה הראשונה מתוך שישה, אשר נמצאת, על פי קביעת בג\"ץ, על קרקע פלסטינית, כאשר השאר יפונו עוד כארבעה חודשים. היועץ המשפטי לממשלה אביחי מנדלבליט גיבש מתווה לפיו הבתים יקבלו היתרי בנייה זמניים, כך שהתושבים ינסרו רק חלק מהבית, 40 ס\"מ בלבד, משום שהוא עומד על קרקע פלסטינית. ראש המועצה האזורית גוש עציון, שלמה נאמן, אמר בעקבות ההתרחשויות כי \"עצוב מאוד שהגענו לרגע המחפיר הזה של אובדן שליטה ושלטון. אומרים לנו שזהו שלטון החוק ואנו אומרים שזהו אובדן השלטון והרס החוק. לא רק מבנה תמים ייהרס הבוקר בנתיב האבות, גם חוק העם הריבון בארצו ייפגע תחת די בניין ההרס. לפני 70 שנה בדיוק הכירו אומות העולם בזכותנו להקים מדינת ישראל ובו ביום גוש עציון נכנס לקרב האחרון שלו - הקרב על ירושלים. הגיעה תורה של ממשלת ישראל להכיר בעובדת שלטון ישראל בכל חבלי הארץ ואין מתאים מגוש עציון שהולך בנתיב אבותיו להתחיל את הצד ההיסטורי הזה של החלת הריבונות\". מהאיחוד הלאומי נמסר: \"מפלגת האיחוד הלאומי מביעה זעזוע לנוכח אי הצדק והעוול המתרחש לנגד עינינו היום בנתיב האבות. יש כאן פינוי מיותר וסתמי פרי יוזמתם של אויבינו ולא פחות גרוע מכך פרי פסיקותיו השערורייתיות של בג\"ץ. אנו נפעל בכל הכוח למנוע מקרים דומים בעתיד ולהסדיר את יתר בתי השכונה במהרה שלא נצטרך לחזות שוב במראות כאלה\".";        
        String bodyTrans3 = TxtTranslator.translate(body3); 
        String[] bodyArr3 = bodyTrans3.split(" ");
        for (int i = 0; i < bodyArr3.length; i++) {
            bodyArr3[i] = bodyArr3[i]
                    .toLowerCase()
                    .replace(",", "")
                    .replace(".", "")
                    .replace("\'", "")
                    .replace("\"", "")
                    .trim();
        }
        
        System.out.println(consineTextSimilarity(bodyArr1, bodyArr2));
    }
}
