

import static java.lang.System.console;
import java.text.DateFormat;
import java.text.ParseException;
import java.text.SimpleDateFormat;
import java.time.LocalDate;
import java.time.Month;
import java.time.format.DateTimeFormatter;
import java.util.Date;
import java.util.Locale;
import java.util.logging.Level;
import java.util.logging.Logger;
import java.util.regex.Pattern;

import java.io.Console;
import static java.lang.System.console;
import java.util.ArrayList;
import java.util.List;
import java.util.regex.Pattern;
import java.util.regex.Matcher;



/*
 * To change this license header, choose License Headers in Project Properties.
 * To change this template file, choose Tools | Templates
 * and open the template in the editor.
 */

/**
 *
 * @author oshrat
 */
public class compare_data {
    
    
public static void main(String [] args){
    

    
        //comparing data from gui and the scraper(articles table)

        
String ynetBodyAer = "  חדשות\n" +
"הפכו את ynet לאתר הבית\n" +
"חדשותכלכלהספורטתרבותרכילות Pplusבריאותדיגיטליהדותרכבחופשאוכלצרכנותנדל\"ןקריירהבעלי חיים יחסיםהוריםמעורבותmynetקניותביג דילHOTעבריתwinwinalljobs\n" +
"דואר אדום · מזג אוויר · מפות · דעות · בלייזר · מדע · אסטרולוגיה · פרוגי · מדריך טלוויזיה · קריירה · בעלי מקצוע · ביטוח · חתונות · דרושים · אלבומים · ynetart · English\n" +
"תחזית:\n" +
"תל אביב\n" +
" 25Cחפשynet\n" +
"\n" +
"חדשותפוליטי מדיניצבא וביטחון\n" +
"\n" +
"צבא וביטחוןמדיניהמערכת הפוליטיתפלסטיניםטורים ופרשנות\n" +
"\n" +
"אתם שיתפתם\n" +
"המסר של אבו מאזן בהפגנת השמאל: \"יחד נעשה את שלום\n" +
"נתניהו החליט: איוב קרא ימונה לשר התקשורת\n" +
"חובשת מד\"א טיפלה באישה - והותקפה באגרופים על ידי\n" +
"מדיניות אי-הפללה למשתמשי הקנאביס יוצאת לדרך\n" +
"זעם בנורבגיה: כספי הסיוע הושקעו במרכז ע\"ש מחבלת\n" +
"אחותה מתה מסרטן לאחר הלידה: \"חייבת להתחזק בשביל\n" +
"מלניה לבשה ז'קט בשווי 51 אלף דולר, מעצב העל אמר\n" +
"בעקבות פיגוע הטרור: בניין עיריית ת\"א הואר בצבעי\n" +
"כ-20 עוכבו בהפגנה סמוך לביתו של היועמ\"ש מנדלבליט\n" +
"זירת הקניות\n" +
" קופונים\n" +
"כרטיסיית 10 כניסות ברמת אפעל ב-249 ₪ כולל סופ\"ש\n" +
"לרכישה >>\n" +
" ביטוח רכב\n" +
"עד 30% הנחה בביטוח המקיף לרכב ו-12 תשלומים שווים!\n" +
"להצעת מחיר >>\n" +
" ידיעות אחרונות\n" +
"ידיעות אחרונות-מהדורת סופ\"ש לחודש מתנה!\n" +
"היכנסו עכשיו >>\n" +
" קניות\n" +
"מיקסר מייג’ור טיטניום חצי תעשייתי 6.7 ליטר 1500W\n" +
"לרכישה >>\n" +
" mastercook\n" +
"זוג מחבתות לבישול בריא יותר, נון סטיק 3 שכבות\n" +
"לרכישה >>\n" +
" טיסות\n" +
"טיסות ישירות ללרנקה ביוני החל מ- $127\n" +
"הזמינו עכשיו >>\n" +
" נעליים\n" +
"נעלי הליכה וטיולים לגברים Merrell מירל ב- 249 ש\"ח\n" +
"לרכישה >>\n" +
"ערעור אזריה: התובע סירב לגישור, בית הדין: \"שהפצ\"ר יתערב\"\n" +
"במהלך הדיון האחרון של הערעור פנה שופט בית הדין הצבאי לצדדים והפציר בהם לסגת מהערעורים. \"שימו בצד את כל המטען הרע ותתעלו\". סנגורו של אזריה מיהר להסכים, אולם התובע סירב: \"לא נשמעה חרטה גם בערעור\". נשיא הרכב השופטים ביקש להביא את הנושא לפתחו של הפרקליט הצבאי הראשי\n" +
"יואב זיתוןעדכון אחרון:  28.05.17 , 14:00\n" +
"\n" +
" \n" +
" אזריה והוריו בבית הדין הצבאי היום  (צילום: מוטי קמחי)\n" +
"אזריה והוריו בבית הדין הצבאי היום (צילום: מוטי קמחי)\n" +
"בית הדין הצבאי בקריה הציע בצהריים (יום א') לצדדים בתיק אלאור אזריה לסגת מהערעורים שהגישו. סנגורו של אזריה, עו\"ד יורם שפטל, מיהר להסכים להצעה והציע הליך גישור, אולם התובע סא\"ל במיל' נדב וייסמן סירב ועמד על כך שבית המשפט יפסוק בתיק. בעקבות סירובו, הורו השופטים על העברת הבקשה לפרקליט הצבאי הראשי ונתנו לצדדים שבוע להודיע אם החלה התפתחות.\n" +
" \n" +
"השופט צבי סגל פנה לשני הצדדים ואמר: \"אנו לא מציעים הצעה קונקרטית ואסור לנו. ראו לנגד עינכם רגע של התעלות ושימו בצד את כל המטען הרע שהיה פה ותתרכזו, שני הצדדים, במה נכון לעשות בנסיבות הקיימות. מילאתם את תפקידכם, אבל לא מיציתם אותו. אנו נכתוב את הכרעת הדין. זה לא ערעור פשוט וכל תוצאה בערעור היא בעייתית. נפסוק לפי חוק ולא כל דבר שאנו מרגישים או רוצים אנו עושים. אנו מכירים את כל החומר על בוריו. יש מדינה וצבא מעבר לזה.\n" +
"זו פנייה לשני הצדדים: עשו את מה שלא עשיתם עד היום ואם לא - נעשה את תפקידנו, אבל זה בתנאי שאתם רואים את העיקר. תתעלו אם אתם יכולים\".\n" +
" \n" +
"בעקבות דברי השופט, עו\"ד שפטל הודיע כי הוא מסכים להליך של גישור שיימשך שבועיים. מנגד, התובע וייסמן אמר כי \"התיק הזה חשוב ועוסק בחשיבות הערכים לצבא. ויכוח על העובדות כבר לא יכול להיות והם הובררו בבית הדין המחוזי. סברנו כל העת שזה תיק שצריכה להינתן בו הכרעה שיפוטית. זה מסוג התיקים שבעוד 20 שנה יהיה מי שירצה לפתוח את הספרים ולדעת מה קרה מבחינת ערכית ומשפטית. כשמגיעים לעסקאות אף אחד בסוף לא יודע מה באמת קרה\".\n" +
" \n" +
"השופט סגל קטע את וייסמן ואמר לו כי \"יש סוג של משפטים שבהם צד אחד מנצח ושני הצדדים מפסידים\". וייסמן אמר כי \"לא נשמעה כאן חרטה, גם לא בערעור. מוטב שבית המשפט יקבע. הנאשם היה מיוצג על ידי צוות הגנה גדול. חשוב מה בית הדין קובע בפרשה החשובה הזו, עובדתית ונורמטבית\".\n" +
" \n" +
"התובע הוסיף ואמר כי \"התיק הזה הוא לא דבר של יום ביומו. חשוב שערכאת הערעור תקבע מה העונש ההולם ועונש צריך למלא את האינטרס הציבורי: שנה וחצי מאסר אינם הולמים את האינטרס הציבורי על הרג תוך הפרת הוראות הפתיחה באש. אם אנו מרגישים הסתייגות מהמעשה של אזריה, אני מבקש למלא את ההזדעזעות בעונש הולם ושנה וחצי זה לא עונש הולם. המלצנו על מתחם עונש ראוי. הציבור בישראל זכאי לפסק דין שמנמק את הפרשה כולה לרבות העונש ההולם\".\n" +
" \n" +
"נשיא בית הדין השופט דורון פיילס השיב לוייסמן: \"שמענו את הדברים באריכות ואנו לא פוחדים ולא מתעצלים לכתוב פסק דין. לפעמים טוב לכתוב הדברים ללא מחלוקת ובאופן קונקרטי. אני מבקש שקריאתנו תעלה לפרקליט הצבאי הראשי\". לאחר מכן סיכם: \"הצדדים מתבקשים לשקול את בקשתנו תוך שמונחים לנגד עיננו השיקולים הרחבים הנוגעים לעניין ולאינטרס הציבורי והצבאי. התובע מתבקש להביא הדברים לעיון הפצ\"ר. על הצדדים להודיע בתוך שבוע אם חלה התפתחות בעניין\".\n" +
" \n" +
"השופטים גערו בשפטל: \"תן כבוד\"\n" +
"עוד קודם לכן, במהלך הדיון, נרשם עימות נוסף בין השופטים לסנגורו של אזריה. אלוף במילואים אייל אייזנברג, חבר הרכב השופטים, שאל את שפטל: \"בהתנהגות אזריה לאחר הירי יש דיסוננס קריטי בזמן התקרבות התאג\"ד לאובייקט (המחבל), תחת איום. איפה היה הנאשם? ההסבר שלך הוא ספקולציה\". שפטל השיב לו: \"אזריה היה בהלם אחרי הירי. מי שבשוק לא מצופה ממנו שיתנהג כמו שצריך. הרי פה קל לנתח תחת המזגנים את מה שהיה בזירה\".\n" +
" \n" +
"דבריו של שפטל עוררו את זעמו של שופט אחר בהרכב, תת-אלוף במילואים אבי פלד ששימש כמח\"ט גולני בעברו. \"תן כבוד לאנשים שיושבים פה\", גער פלד בסנגור. \"אייל ואני לא ישבנו 40 שנה במזגנים. לנו יש פה ההבנה המבצעית\".\n" +
" \n" +
"\n" +
"אלאור אזריה בבית הדין, הבוקר    (צילום: מתן טורקיה) \n" +
"by Taboola.\n" +
"הדיון האחרון בערעור אזריה: \"למה מסר את הקסדה אם חשש ממטען?\"\n" +
"יחיד ומיוחד: בן זוגו של ר\"מ לוקסמבורג כבש את נשות המנהיגים\n" +
"פורטלנד: גברים הגנו על מוסלמיות ברכבת - ונרצחו\n" +
" בני המשפחה עם עו\"ד שפטל בבית הדין (צילום: מוטי קמחי)\n" +
"בני המשפחה עם עו\"ד שפטל בבית הדין(צילום: מוטי קמחי)\n" +
" \n" +
"פלד גם שלח עקיצה לעבר שפטל. \"ממך עדיין לא מצאתי שביב ששינה את העובדות עד כה ואני מחכה לזה בקוצר רוח ועוד מעט נגמר הערעור. אני לא שומע את זה ממך\", כך השופט.\n" +
" \n" +
"מוקדם יותר היום הגיב שפטל לערעור התביעה הצבאית שדורשת להחמיר בעונשו של אזריה לשנתיים וחצי מאסר לכל הפחות. השופט צבי סגל פנה לשפטל, ואמר: \"אף אחד מהחיילים והקצינים והאזרחים החמושים בזירה, למרות שחשו סכנה, לא דרך את נשקו ולא ירה במחבל\". השופט תא\"ל במיל' אבי פלד פנה גם הוא לעו\"ד לשפטל, ואמר: \"אני לא שומע ממך למה המערער, בניגוד לכל האחרים בזירה, חש סכנה וירה?\".\n" +
" \n" +
"שפטל פתח את הדיון שוב בטיעון המרכזי של ההגנה בערכאת הערעור על חילופי הגרסאות של שני עדי תביעה מרכזיים: רב\"ט מ', לוחם שהיה בזירה והמ\"פ רס\"ן תום נעמן: \"למ\"פ היו תשע גרסאות ולרב\"ט מ' היו 14 גרסאות. הדרך היחידה לנטרל את המחבל בסיטואציה הזו הייתה בירי לראש\". השופטים ניסו להקשות, או שמא למצוא דרך להקל על אזריה, ושאלו את שפטל מה יהיו טיעוניו החלופיים אם בית המשפט ידחה את הטיעון הזה ויאמץ את החלטת הערכאה הקודמת כי אזריה לא היה מהימן בגרסתו. השופט פיילס שאל את שפטל אם יש לו ראיות לכך שעדותו של רב\"ט מ' \"נתפרה בגסות\" או שזו פרשנות שלו. שפטל השיב כי \"זו ראיית מנהרה מרושעת להביא לממצאים פליליים בכל מחיר\".\n" +
" \n" +
"השופט סגל שאל את שפטל גם אם \"יש הסבר למה אזריה מסר את הקסדה לחברו לפני הירי? הרי הוא חשש ממטען\". עו\"ד שפטל השיב: \"אני לא זוכר. הוא לא נשאל על כך. מישהו נכנס לדקויות כאלה בכלל? מה נטפלו לאזריה עם דקויות כאלה\"? לאחר מכן התייחס שפטל שוב לעניין זה ואמר כי \"כשמדובר בירי שאינו מתוכנן מראש מורידים את הקסדה בשביל הירי\". השופט פלד, ששימש בעבר מח\"ט גולני, השיב לו: \"זאת לא תשובה מקצועית. לא מוציאים קסדה כדי לבצע ירי קרוב\".\n" +
"מצאתם טעות בכתבה? כתבו לנו";
        
String maarivBodyArt = "  ראש בית הדין לערעורים בקריה רומז לשני הצדדים: \"ותרו על הערעור במשפט אזריה\"\n" +
"משפחת אזריה הגיעה לחלק האחרון בערעור על גזר הדין. השופט סגל \"יש של משפטים ששני הצדדים מפסידים בהם\". התובע: \"זה תיק שצריך להסתיים בהכרעה שיפוטית\"\n" +
"משה כהן  / 28/05/2017 08:40 עודכן בתאריך: 28/05/2017 14:14\n" +
"תגיות: יורם שפטל אלאור אזריה\n" +
" \n" +
"אלאור אזריה\n" +
"אלאור אזריה. (צילום:אבשלום ששוני)\n" +
"שתף בפייסבוק  שתף בטוויטר\n" +
"בבית הדין לערעורים בקריה בתל אביב החל הבוקר (ראשון) הדיון האחרון בערעורו של החייל היורה, אלאור אזריה, שהורשע בהריגת מחבל לאחר שנוטרל.\n" +
"\n" +
"אזריה הורשע בגלל עדותו של המ\"פ, וכעת השופטים מבקרים את העדות הזו. במהלך שניים מתוך שלושת הדיונים הראשונים, הבין שפטל כי יש חשיבות מכרעת לשתי העדויות של המ\"פ תום נעמן והחייל מ' שהעיד נגד אזריה.\n" +
"  \n" +
"\n" +
"\n" +
"בתחילת הדיון, אמר עורך הדין יורם שפטל, המייצג את החייל, כי \"בנסיבות הספציפיות של התיק הזה, האפשרות היחידה לנטרל את המחבל היתה באמצעות ירי לראש\". הוא ציין: \"התובע אומר שלאזריה יש חמש גרסאות, איך אפשר להאמין לו. למ\"פ יש תשע גרסאות, ולרב\"ט מ' - 14\".\n" +
"\n" +
"השופט סגל אמר לו כי \"אם בית הדין יקבע כי שני העדים הללו, המ\"פ ומ', מהימנים, או מי מביניהם - לך אין טיעון נוסף, אחר, וחלופי?\", ושפטל השיב: \"זה מה שבאתי להבהיר. יש לפנינו עדויות אמינות שמשמעותן הגנה מוחלטת לאזריה, אבל כל אלו נדחות על בסיס המשפט שמיוחס לו - 'אני יריתי במחבל כי דקר חבר שלי'\".\n" +
"\n" +
"אלאור אזריה ואביו צ'רלי אזריה. צילום: אבשלום ששוניאלאור אזריה ואביו צ'רלי אזריה. צילום: אבשלום ששוני\n" +
"\n" +
"הבוקר נפתח במתקפה גדולה על הנושאים האלה, במה שמסתמן כתרגיל יפה לתביעה. שפטל למעשה הוכיח היום בבית המשפט שרב סרן תום נעמן והחייל הגיעו למצ\"ח עם גרסה אחת ואחר כך הגיעו לבית הדין עם גרסה אחרת לגמרי. החייל אומר שאלאור אמר שהמחבל צריך למות. אחרי 4 חקירות החייל מ' שינה את הגרסה שלו. השופטים הביעו ביקורת כלפי התנהלות בית המשפט הקודם, גם מצד הסנגוריה שלא העלתה את זה וגם נגד התובע.\n" +
" \n" +
"\n" +
"סגל פנה שוב לשפטל - \"והיה ובית הדין הזה יאמץ את קביעת בית הדין הקודם, ויקבע חוסר מהימנות לגבי אזריה, מה המשמעות של זה?\". הפרקליט השיב כי \"ברור שאם ערכאת הערעור מאמצת את כל הנימוקים של בית הדין הקודם, אז ברור שהערעור יידחה. אבל אני בא ואומר: עדויות המ\"פ והרב\"ט מתרסקות\". הוא המשיך לטעון כי \"שפטל ממשיך לטעון: הייתה גם תחושת סכנה\". השופט התייחס לטענה: \"כל אחד מהאזרחים שם, נושאי הנשק, והחיילים נושאי הנשק - אף אחד מהם לא דרך את הנשק שלו וירה במחבל\". \n" +
"\n" +
"השופט פלד הוסיף: \"למה הוא פעל בניגוד לכל השאר? כולם עומדים עם הגב למחבל, איך הם לא מרגישים סכנה, והמערער כן?\". שפטל השיב שהוא עשה זאת מפני ש\"ראה את היד של המחבל זזה\". הוא הזכיר את החלטת השופט פיילס לשחרר את אזריה למעצר פתוח. \"אם אין ראיות מצדיקה למעצר, אז וודאי שלא ייתכן שיש די ראיות שמצדיקות הרשעה\". הפרקליט ציין כי \"מדובר בהחלטה שהתקבלה יותר לפני משנה, בה נקב פיילס בביטוי \"התמונה לכאן ולכאן, לכן לא ניתן לומר שהירי הוא בלתי חוקי\".\n" +
"\n" +
"אלאור אזריה בכניסה לבית הדין. צילום: אבשלום ששוניאלאור אזריה בכניסה לבית הדין. צילום: אבשלום ששוני\n" +
"\n" +
"סגן א', שהיה סגן מפקד הפלוגה של אזריה, נכנס לדיון כדי לתמוך בחייל. כיום הוא עכשיו משרת בגבעתי. \"את מרכז הכובד אתה מטיל על עניין המ\"פ ושינוי הגרסה וזיופה, לטענתך. אבל הוא לא נחקר על כך, בחקירה נגדית. ולא רק הוא - גם החוקר שלו במצ\"ח\", אמר השופט סגל. השופט פייסל הוסיף כי \"זיוף זה ביטוי מטעה פה. לא החתימו אותו על משהו שלא קרה\". שפטל השיב לשניהם: \"כשבחקירה שניה הופכים את העדות, זה זיוף. אם הייתי בבית הדין, סביר להניח שהייתי חוקר את המ\"פ\". \n" +
"\n" +
"שפטל חוזר ומקריא כמה פסקי דין שלדברי תומכים באזריה. \"זה לכל הפחות מגיע לכדי זיכויו, או לאי-פתיחת חקירה\", אמר, \"האינטרקציה בין אזריה למחבל היא לא 11 דקות, היא 11 שניות. וזה הרבה יותר קצר מאשר זו שהייתה עם השוטר המתנדב ביפו, שהקהל עודד אותו לירות\". הוא ציין כי הנימוק שעלה לכך שאזריה מסר את הקסדה היה חשש  מפני גניבה.\n" +
"\n" +
"השופט סגל אמר כי \"יותר הגיוני, שאם חושש ממטען, ברגע שאתה הולך לירות, זה לחבוש את הקסדה, לא למסור אותה\", שפטל השיב בצורה מתחמקת: \"במקרים אחרים הדקויות האלו לא עלו. האם כן חבש קסדה או לא\". סגל הוסיף: \"אני מחפשת את ההיגיון בזה שהוא מוסר את הקסדה בזמן שהוא חושש ממטען\".\n" +
"\n" +
"שפטל אמר כי \"היתה סכנה מוחשית באותו הרגע. היה חשש שעל גופו של המחבל, שמספר דקות קודם לכן, ניסה להרוג חיילים ולבש מעיל יש מטען חבלה. גם המ\"מ העיד על החשש\". הוא הוסיף: \"בדיעבד הירי בראש היה טעות, כי בעת האירוע הנאשם סבר שיש מטען על המחבל\".\n" +
"\n" +
"המ\"פ העיד שאם היה רואה את המחבל מתחיל לקום - היה יורה בו\"\n" +
"\n" +
"עורך דינו של החייל המשיך ואמר כי \"אם אכן אזריה אמר שהמחבל צריך למות - מדוע המח\"ט לא הישעה אותו מייד? הוא לא הושעה ואחרי האירוע הלך לאבטח בנשק את העדלאידע\". לדבריו, יש סתירות גם בין עדויות המ\"פ והמג\"ד. \"העדות של המג\"ד היא עדות שמיעה, כמו עדות המח\"ט. לכן העדויות שלהם אינן תומכות בעדות המ\"פ\", הסביר, \"כמו שהמ\"פ טעה בעדות שלו במצ\"ח שהסכין היתה כמה סנטימטרים מהמחבל - גם אלאור טעה בדיעבד\".\n" +
"\n" +
"שפטל טען כי \"בית הדין ביסס את הרשעת אזריה על שתי עדויות בלבד מתוך שבע עדויות של חיילים בזירה\". לדבריו, אם לחייל הנדקר לא היה מעצור בנשק והיה יורה במחבל - כנראה שלא היינו כאן. זה לא המקרה של הירי של הנאשם. \"אחד מהעדים העיד שאם היה רואה את היד של המחבל זזה -היה יורה בו וגם המ\"פ העיד שאם היה רואה את המחבל מתחיל לקום - הוא היה יורה בו, נימוקי ההרשעה של בחת הדין מופרכים לחלוטין\". הוא הוסיף: \"בית הדין שלל את טענת הכנות שאזריה חש בסכנה סובייקטיבית, הם התעלמו מראיות\". צ'רלי אזריה התפרץ לדיון: \"המ\"מ דיבר איתו\". בית הדין ביקש ממנו לא להתערב בדיון והוא התנצל.\n" +
"\n" +
"\n" +
"נשיא בית הדין לערעורים אלוף דורון פיילס רמז לשני הצדדים לבטל את הערעור. \"בית הדין צריך להציע לצדדים ללכת לגישור. רק זה יכול להצמיח הסכמות\", אמר, \"זה תיק חשוב ועוסק בסולם הערכים של הצבא, זה תיק שיבהיר את הנורמות הערכיות בצה\"ל\". שפטל התפרץ ואמר: \"אתה לא יכול להעלות עכשיו טיעון להרשעה\". התובע נדב וויסמן אמר כי \"זה תיק שצריך להסתיים בהכרעה שיפוטית\". השופט סגל הוסיף כי \"יש סוג של משפטים ששני הצדדים מפסידים בהם\". \n" +
"\n" +
"\n" +
"\n" +
"אלאור אזריה עם אביו ועורך הדים שפטל בבית הדין. צילום: אבשלום ששוניאלאור אזריה עם אביו ועורך הדים שפטל בבית הדין. צילום: אבשלום ששוני\n" +
"\n" +
"כזכור, בתחילת הדיון טען פרקליטו של החייל עורך הדין יורם שפטל כי \"התובע חזר לפחות עשר פעמים על הטענה שעדות המח\"ט מגבה את עדות המ\"פ, אבל בפועל אין זכר בעדות המח\"ט בעדותו במצ\"ח שהוא שמע מהמ\"פ בשטח שאלאור אמר שמחבל צריך למות\". התובע אמר כי \"זה טיעון חדש של התביעה שלא היה בכתב הערעור ואני מתנגד להעלאתו\". שפטל השיב: \"אני מבסס את גרסת אזריה על דברי עדי התביעה\". \n" +
"\n" +
"השופט סגל ציין כי גרסת הנאשם מאוד מהותית לקביעה אם עדותו אמינה או לא, ותהה \"מהי גרסת הנאשם? האחרונה שמסר בעדותו בבית הדין?\". שפטל הסביר כי \"אזריה חשש מהסכין ומכך שהמחבל נשא מטען. היו שינויי גרסאות בעדויות המ\"פ - גרסתו הראשונה של המ\"פ היתה שאלאור אמר לו לאחר הירי שירה במחבל בגלל שראה אותו זז, בהמשך המג\"ד אישר בעדותו שאלאור אמר לו שהסכין היתה ליד המחבל והוא ראה אותו זז וגם המח\"ט העיד כך בעדותו הראשונה\".\n" +
"\n" +
"פרקליטו של אזריה אמר כי \"המ\"פ אמר בעדות שאם היה חש בסכנה - היה יורה במחבל. זה מה שאלאור עשה, הוא חש בסכנה. לא הייתה לו אפשרות לצעוק שיש מטען, אבל גם אם היתה - זו טעות מבצעית\". השופט סגל הסביר כי \"אם נטען על סכין קרובה ליד של המחבל - אז תירה לו ביד!\". לדברי שפטל, זה היה מקרה של הגנה עצמית ותחושת סכנה. הדבר המידתי הוא לירות במחבל רוצח שדקר עשר דקות לפני כן חיילים\".\n" +
"\n" +
"עו\"ד נדב ויסמן אמר כי \"לא היה עוד אירוע כזה שירו במחבל כשהוא שוכב פצוע במשך 11 דקות אחרי האירוע. זה מקרה חריג\". הוא הוסיף: \"יש שלב שבו אדם יוצא ממעגל הלחימה. המחבל היה רוצח אבל הוא יצא ממעגל הלחימה\". לדברי ויסמן, מאז שנת 2003 לא היתה חגורת נפץ בגזרה הזו. הוא תהה מדוע אזריה לא הזהיר לפני שירה במחבל: \"בראשו היו מניעים אחרים, כמו הדברים שאמר לאחר הירי שהמחבל צריך למות\".";
        
        
        
        
        
        
      
        
        try {
            
        String ynetDate = "28.05.17 , 14:00";
        DateFormat yFormat = new SimpleDateFormat("dd.mm.yy , hh:mm", Locale.US);
        Date yDate = yFormat.parse(ynetDate);
        System.out.println(ynetDate);
       
        // pit string with "updated laitly
        //date from maativ spit string with "updated recently"
        String maarivDate = " 28/05/2017 08:40 עודכן בתאריך: 28/05/2017 14:14" ;
        String[] parts = maarivDate.split( "עודכן בתאריך:");
        String mPart1 = parts[0]; // 
        String mPart2 = parts[1]; //
            
        DateFormat mFormat = new SimpleDateFormat("dd/mm/yyyy hh:mm", Locale.US);
        Date mDate = mFormat.parse(mPart2);
        System.out.println(mPart2);

        //comparing dates of ynet and maariv
        if(mDate == yDate){
            System.out.println("similar Dates");  
        }
        
    } catch (ParseException ex) {
        Logger.getLogger(compare_data.class.getName()).log(Level.SEVERE, null, ex);
    }
  
 //Extracting dates from the body of the articles
 //ynetBodyAer and maarivBodyArt by regex
  
 Pattern ynetPattern = Pattern.compile("([0-9]{2})-([0-9]{2})-([0-9]{4})");
 Pattern maarivPattern =  Pattern.compile("\"\\d{2}\\/\\d{2}\\/\\d{4}/\"");
 
 //searching for dates in each body of an article
 //private static final Pattern TAG_REGEX = Pattern.compile("<tag>(.+?)</tag>");
//looking for the same dates from Gui(searchTask table) to the input of the scrapers (article table)

//add each date in ynetBodyArt that is similare to ynet dateformat to an arrayList
   final List<String> tagValues = new ArrayList<String>();
    final Matcher matcher = ynetPattern.matcher(ynetBodyAer);
    //keep going throught the tabels and search for identical dates for in for
  
  
    //same about maariv
    
    
    
    
   //installing google API
   
   
   
   //using sentiwordnet
   
   
   
   
   
   
    
}
 
 





}
    

